var startEvents=[
    {
        "beginDate": "1812-06-07T05:30",
        "endDate": "1812-11-07T17:00",
        "name": "Отечественная война 1812 года",
        "discription": "Отечественная война 1812 года, во французской историографии — Русская кампания 1812 года (фр. Campagne de Russie 1812) — война между Российской и Французской империями на территории России в 1812 году. В отечественной историографии называлась «нашествием двенадцати языков», в связи с многонациональным составом армии Наполеона.",
        "reasons": []
    },
    {
        "beginDate": "1772-01-01T00:00",
        "endDate": "1795-01-01T00:00",
        "name": "Разделы Речи Посполитой",
        "discription": "Первый раздел Речи Посполитой (польск. Pierwszy rozbiór Rzeczypospolitej, Первый раздел Польши, польск. Pierwszy rozbiór Polski) — аннексия части земель Речи Посполитой тремя соседними с ней государствами — Прусским королевством, Австрийским эрцгерцогством и Российской империей, произошедшая в 1772 году. Первый из трёх разделов Речи Посполитой, в результате которых она прекратила существование в 1795 году.\nВторой раздел Речи Посполитой (польск. Drugi rozbiór Rzeczypospolitej) или Второй раздел Польши (польск. Drugi rozbiór Polski) произошёл в 1793 году и был вторым из трёх разделов, прекративших существование Речи Посполитой в 1795 году. Второй раздел произошёл в период после войны сторонников Конституции и Тарговицкой конфедерации 1792 года и был проведён между Российской империей и Пруссией. Он был ратифицирован сеймом в 1793 году.\nТретий раздел Речи Посполитой (Третий раздел Польши, польск. III rozbiór Polski) — последний из разделов Речи Посполитой, в результате которого она прекратила существование как суверенное государство.\n\nПоражение восстания Костюшко (1794), направленного против разделов страны, послужило поводом для окончательной ликвидации польско-литовского государства. 24 октября 1795 года государства, участвующие в разделе, определили свои новые границы. Одновременно с этим условием был подписан тайный договор в Петербурге между Австрией и Россией, явно враждебный Пруссии — о военной помощи в случае, если Пруссия нападёт на какое-нибудь из союзных государств.",
        "reasons": []
    },
    {
        "beginDate": "1809-04-09T00:00",
        "endDate": "1809-10-14T00:00",
        "name": "Война пятой коалиции",
        "discription": "Война Пятой антифранцузской коалиции, также известная как австро-французская война — военный конфликт между Австрийской империей и Великобританией, с одной стороны, и Французской империей Наполеона и его союзниками, с другой. Главные военные события разворачивались в Центральной Европе с апреля по июль 1809 года. Англия в это время была втянута в войну на Пиренейском полуострове, но она, под давлением австрийцев, высадила свой десант в Нидерландах. Это не повлияло на результат войны. После проведений боевых действий в Баварии и долине Дуная война закончилась успешно для французов после сражения под Ваграмом. Это была самая непродолжительная коалиция за всю историю наполеоновских войн.",
        "reasons": []
    },
    {
        "beginDate": "1740-01-01T00:00",
        "endDate": "1742-01-01T00:00",
        "name": "Первая Силезская война",
        "discription": "Первая Силезская война (1740—1742) первая из трёх так называемых Силезских войн, происходившая в рамках войны за австрийское наследство, в которых столкнулись интересы государств Пруссии и Австрии, которыми управляли соответственно Фридрих II Великий и Мария-Терезия, за контроль над австрийской Силезией. Также в войне принимали участие союзники обеих сторон. Война завершилась переходом Силезии, имевшей смешанное немецко-польско-чешско-еврейское население, под власть Пруссии, которая победила в войне.",
        "reasons": []
        
    },
    {
         "beginDate": "1735-05-31T00:00",
        "endDate": "1739-09-29T00:00",
        "name": "Русско-турецкая война (1735—1739)",
        "discription": "Русско-турецкая война 1735—1739 — война между Российской (в союзе со Священной Римской Империей) и Османской империями, вызванная возросшими противоречиями в связи с итогом Войны за польское наследство, а также с продолжавшимися походами крымских татар на южнорусские земли (Новороссия).\n\nПомимо этого, война с Османской империей (Турцией) соответствовала долгосрочной стратегии России по обретению выхода к Чёрному морю.",
        "reasons": []
    },
    {
        "beginDate": "1805-09-25T00:00",
        "endDate": "1805-12-26T00:00",
        "name": "Война Третьей коалиции",
        "discription": "Война Третьей коалиции — война между Францией, Испанией, Баварией и Италией с одной стороны и Третьей антифранцузской коалицией, в которую входили Австрийская империя, Россия, Великобритания, Швеция и Неаполитанское королевство, — с другой.",
        "reasons": []
    },
    {
        "beginDate": "1799-11-18T00:00",
        "endDate": "1800-02-19T00:00",
        "name": "Приход Наполеона к власти",
        "discription": " 18 брюмера (9 ноября 1799) Совет старейшин, большинство в котором было у заговорщиков, принял декреты о переносе заседаний двух палат в Сен-Клу и о назначении Бонапарта командующим департамента Сены. 19 февраля 1800 года Наполеон покинул Люксембургский дворец и поселился в Тюильри.",
        "reasons": []
    },
    {
        "beginDate": "1744-01-01T00:00",
        "endDate": "1745-01-01T00:00",
        "name": "Вторая Силезская война",
        "discription": "Вторая Силезская война (1744—1745 годов) — второй из трёх крупных военных конфликтов в Центральной Европе, происходящих в рамках так называемых Силезских войн, в которых столкнулись интересы немецкоязычных государств Пруссии и Австрии. Управляли этими двумя государствами соответственно Фридрих II Прусский и Мария-Терезия Австрийская.\nПруссия заключила союз с Испанией в Фонтенбло в октябре 1743 года.[источник не указан 133 дня] Пруссия заключила союз с Баварией, Швецией, Гессен–Касселем и Курпфальцем, известный как \"Франкфуртская Лига\", объявленной целью которой было восстановление и защита территорий императора Карла Альбрехта, включая Богемию (где он был провозглашен королем в 1742 году). Параллельно был заключен договор с Францией, в соответствии с которым Франция обязалась поддержать \"Лигу\" и напасть на Австрийские Нидерланды. Против Австрии, таким образом, помимо \"Франкфуртской Лиги\" выступали и Франция с Испанией.\nАвстрия уже во время войны укрепила свои дипломатические позиции Варшавским договором, который установил новый \"Четверной союз\" между Австрией, Великобританией–Ганновером, Саксонией и Голландской Республикой, направленный на противодействие \"Франкфуртской Лиге\" и восстановление традиционных границ Габсбургской монархии. По условиям договора курфюрст Саксонии Фридрих Август II выставлял 30 000 солдат в обмен на денежные субсидии от \"морских держав\" — британцев и голландцев.[2] На стороне Австрии выступила также Сардиния.\nВойна вновь завершилась победой Пруссии. Австрия вынуждена была окончательно проститься с надеждами вернуть Силезию.",
        "reasons": []
    },
    {
        "beginDate": "1701-07-09T00:00",
        "endDate": "1714-03-07T00:00",
        "name": "Война за испанское наследство",
        "discription": "Война за испанское наследство (1701—1714) — крупный европейский конфликт, начавшийся в 1701 году после смерти последнего испанского короля из династии Габсбургов, Карла II. Карл завещал все свои владения Филиппу, герцогу Анжуйскому — внуку французского короля Людовика XIV — который впоследствии стал королём Филиппом V Испанским. Война началась с попытки императора Священной Римской империи Леопольда I защитить право своей династии (также Габсбургов) на испанские владения. Когда же Людовик XIV начал более агрессивно расширять свои территории, некоторые европейские державы (главным образом Англия и Голландская республика) выступили на стороне Священной Римской империи, чтобы воспрепятствовать усилению Франции. Другие государства присоединились к союзу Франции и Испании, чтобы попытаться заполучить новые территории или же защитить уже имеющиеся. Война проходила не только в Европе, но и в Северной Америке, где локальный конфликт был назван английскими колонистами войной королевы Анны.\n\nВойна длилась более десятилетия, и в ней проявились таланты таких известных полководцев, как герцог де Виллар и герцог Бервик (Франция), герцог Мальборо (Англия) и принц Евгений Савойский (Австрия). Война завершилась подписанием Утрехтского (1713) и Раштатского (1714) соглашений. В результате Филипп V остался королём Испании, но лишился права наследовать французский престол, что разорвало династический союз корон Франции и Испании. Австрийские Габсбурги получили большую часть испанских владений в Италии и Нидерландах. Франция, в свою очередь, сохранила за собой все предыдущие завоевания Людовика XIV, а также получила княжество Оранж и Барселоннет. В итоге угроза окружения Франции владениями Габсбургов исчезла навсегда.",
        "reasons": []
    },
    {
        "beginDate": "1700-02-12T00:00",
        "endDate": "1714-08-30T00:00",
        "name": "Северная война",
        "discription": "Северная война (Великая Северная война, Двадцатилетняя война) — война, фактически длившаяся с 1700 по 1721 год между Шведским королевством и коалицией государств Северной Европы (в том числе, Саксония, Русское царство, Датско-норвежское королевство, Речь Посполитая и др.) за обладание прибалтийскими землями и господство на Балтийском море и его побережье, закончившаяся поражением Швеции, навсегда утратившей статус великой державы.",
        "reasons": []
    },
    {
        "beginDate": "1808-05-02T00:00",
        "endDate": "1814-04-17T00:00",
        "name": "Пиренейские войны",
        "discription": "Пиренейская война — совокупность вооружённых конфликтов на Пиренейском полуострове в ходе наполеоновских войн начала XIX века, в которых Наполеоновской империи противостоял союз Испании, Португалии и Великобритании.\nВойна в Испании началась с Мадридского восстания 2 мая 1808 года, жестоко подавленного французскими войсками. Хотя боевые действия на полуострове не затихали до самого низложения Наполеона в 1814 году и содержание пиренейских армий требовало огромных материальных ресурсов, этот фронт (равно как и неаполитанский) не оказал решающего влияния на исход противостояния Наполеона с другими державами.\nБритания воспользовалась проблемами испанской метрополии для того, чтобы прирастить свои колониальные владения. Именно на это время пришлись неоднократные попытки англичан закрепиться в Южной Америке (см. британские вторжения в вице-королевство Рио-де-ла-Плата).\nВ некоторых отношениях Испанская кампания послужила репетицией Русской кампании 1812 года: отсутствие решающего сражения, широкомасштабное партизанское движение, проблемы с подвозом амуниции по враждебно настроенной территории — всё это изматывало силы оккупантов. Как результат наполеоновская армия терпела болезненные неудачи (битва при Байлене и др.).\nВ то же время для англичан Пиренеи стали основным театром сухопутных боевых действий, где в полной мере проявился полководческий талант герцога Веллингтона. Да и сам Наполеон признавался на острове св. Елены: «Эта несчастная война в Испании стала кровоточащей раной, первопричиной несчастий Франции».",
        "reasons": []
    },
    {
        "beginDate": "1768-01-01T00:00",
        "endDate": "1774-01-01T00:00",
        "name": "Русско-турецкая война (1768—1774)",
        "discription": "усско-турецкая война 1768—1774 годов (современное турецкое название: 1768—1774 Osmanlı-Rus Savaşı) — одна из ключевых по значению войн между Российской и Османской империями. Основной целью войны со стороны России являлось получение выхода к Чёрному морю, Турция рассчитывала получить обещанные ей Барской конфедерацией Подолию и Волынь, расширить свои владения в Северном Причерноморье и на Кавказе, и установить протекторат над Речью Посполитой[8].\n\nВ ходе войны русская армия под командованием Петра Румянцева и Александра Суворова разгромила турецкие войска в битвах при Ларге, Кагуле и Козлуджи, а средиземноморская эскадра русского флота под командованием Алексея Орлова и Григория Спиридова нанесла поражение турецкому флоту в Чесменском и Патрасском сражениях.\n\nВойне предшествовали сложная европейская дипломатическая игра, которую вели друг против друга Россия и Франция, а также политический кризис в Речи Посполитой. В результате французских и польских интриг османский султан Мустафа III объявил войну России, воспользовавшись как предлогом действиями повстанцев-колиев и вводом русской армии в пограничные местности Речи Посполитой. На стороне Турции воевало вассальное от неё Крымское ханство, включая некрасовцев. Кроме того, турецкое правительство заручилось поддержкой польских повстанцев-конфедератов. Со стороны России, кроме регулярной армии и флота, боевые действия вели отряды донских, терских, малороссийских и запорожских казаков, в том числе флотилии запорожцев, а также калмыки. В ходе войны на территории Османской империи в 1770 году при поддержке русского флота подняли восстание греки Пелопоннесса, а в 1771 году взбунтовались Египет и Сирия.\n\n10 (21) июля 1774 года Османская империя вынуждена была подписать с Россией Кючук-Кайнарджийский договор. В результате войны, закончившейся победой Российской империи, в её состав вошли первые земли в Крыму — крепости Керчь и Еникале (остальной Крым был присоединён к России на 9 лет позже — в 1783 году), на северном побережье Чёрного моря — Кинбурн с прилегающими территориями, а также территории, прилегающие к Азову (сам город принадлежал России с 1739 года) и Кабарда. Была признана полная независимость Крымского ханства как от России, так и от Турции: «Все татарские народы: крымские, буджатские, кубанские, едисанцы, жамбуйлуки и едичкулы, без изъятия от обеих империй имеют быть признаны вольными и совершенно независимыми от всякой посторонней власти, но пребывающими под самодержавной властью собственного их хана чингисского поколения». Россия получила право вести торговлю и обладать военным флотом на Чёрном море.",
        "reasons": []
    },
    {
        "beginDate": "1813-01-13T00:00",
        "endDate": "1814-05-30T00:00",
        "name": "Война шестой коалиции",
        "discription": "Война шестой коалиции — война коалиции европейских держав против Наполеоновской Франции и её союзников.\n\nАнтифранцузская коалиция сложилась после уничтожения Великой армии Наполеона в России в ходе Русской кампании 1812 года. В начале 1813 года войну против Наполеона в центральной Европе вела только Россия. В коалицию с Россией в марте 1813 года вошла Пруссия, затем летом того же года вступили Великобритания, Австрия и Швеция, а после разгрома Наполеона в Битве народов под Лейпцигом в октябре 1813 года к коалиции присоединились германские государства Вюртемберг и Бавария. Независимо с Наполеоном на Пиренейском полуострове воевали Испания, Португалия и Англия. Активные боевые действия велись в течение года с мая 1813 года до апреля 1814 года с 2-месячным перемирием летом 1813 года. В 1813 году война против Наполеона велась с переменным успехом на территории Германии, главным образом в Пруссии и Саксонии. В 1814 году боевые действия переместились на территорию Франции и завершились к апрелю 1814 года взятием Парижа и отречением Наполеона от власти.\n\nНемецкая историография выделяет в самостоятельный эпизод этой войны Освободительную войну в Германии, оказавшую решающее влияние на создание через полвека Второго Рейха. В российской историографии война Шестой коалиции известна также как Заграничный поход русской армии 1813—1814 годов.",
        "reasons": []
    },
    {
        "beginDate": "1710-11-20T00:00",
        "endDate": "1713-06-24T00:00",
        "name": "Русско-турецкая война (1710—1713)",
        "discription": "Русско-турецкая война 1710—1713 годов — война между Русским царством и Османской империей. Основным событием стал неудачный Прутский поход царя Петра I в 1711 году, приведший Россию к поражению в войне.",
        "reasons": []
    },
    {
        "beginDate": "1805-11-20T09:00",
        "endDate": "1805-11-20T18:00",
        "name": "Битва под Аустерлицем",
        "discription": "Битва под Аустерлицем (20 ноября 1805 года) — решающее сражение наполеоновской армии против армий третьей антинаполеоновской коалиции. Вошло в историю как «битва трёх императоров», поскольку против армии императора Наполеона I сражались армии императоров австрийского Франца II и русского Александра I.",
        "reasons": []
    },
    {
        "beginDate": "1698-01-01T00:00",
        "endDate": "1725-01-01T00:00",
        "name": "Реформы Петра I",
        "discription": "Реформы Петра I, Петровские преобразования XVIII века — преобразования в государственной и общественной жизни, осуществлённые в период правления в России Петра I 1725 гг.\n\nВсю реформаторскую деятельность Петра I условно можно разделить на три периода (этапа): 1696 — 1721 гг. — Азовская кампания Петра и период Северной войны (1700—1721), включая основание Санкт—Петербурга в 1703 г. и Полтавскую битву в 1709 году, а далее — 1721-1725 гг. — время становления Российской империи; походы на Кавказ и кончина Петра в феврале 1725 года.",
        "reasons": []
    },
    {
        "beginDate": "1756-05-17T00:00",
        "endDate": "1763-02-26T00:00",
        "name": "Семилетняя война",
        "discription": "Семилетняя война (1756—1763) — крупный военный конфликт XVIII века, один из самых масштабных конфликтов Нового времени. Семилетняя война шла как в Европе, так и за океаном: в Северной Америке, в странах Карибского бассейна, в Индии, на Филиппинах. В войне приняли участие все европейские великие державы того времени, а также большинство средних и мелких государств Европы и даже некоторые индейские племена. Уинстоном Черчиллем война даже была названа «первой мировой войной». Войну считают колониальной, так как в ней столкнулись колониальные интересы Великобритании, Франции, Португалии и Испании, а также первой окопной — из-за применения в войне большого количества редутов и других быстровозводимых укреплений — и первой артиллерийской войной: число пушек в ней с 1756 года — 2 на 1000 штыков, с 1759 года — 3—4 пушки на 1000 штыков и 5—6 пушек в 1761 году.\n\nОсновное противостояние в Европе происходило между Австрией и Пруссией из-за Силезии, потерянной Австрией в предыдущих Силезских войнах. Поэтому Семилетнюю войну называют также третьей Силезской войной[11]. Первая Силезская война (1740—1742) и Вторая Силезская война (1744—1748) являются составной частью Войны за австрийское наследство. В шведской историографии война известна как Померанская война (швед. Pommerska kriget), в Канаде — как «Завоевательная война» (англ. The War of the Conquest) и в Индии как «Третья Карнатикская война» (англ. The Third Carnatic War). Североамериканский театр Семилетней войны известен также под названиями «Война с французами и индейцами» (англ. French and Indian War) или «Война завоевания» (фр. Guerre de la Conquête).",
        "reasons": []
    },
    {
        "beginDate": "1806-11-23T00:00",
        "endDate": "1812-05-28T00:00",
        "name": "Русско-турецкая война (1806—1812)",
        "discription": "Русско-турецкая война 1806-1812 годов была одним из звеньев в серии войн между Российской и Османской империями.\nК России переходила восточная часть Молдавского княжества — территория Пруто-Днестровского междуречья, получившая затем статус Бессарабской области.\nГраница в Европе переносилась с реки Днестр на Прут до его соединения с Дунаем, обеспечивалась свобода русского торгового судоходства по этой реке.\nДунайские княжества возвращались Турции, но подтверждалась их автономия, дарованная на основе Кючук-Кайнарджийского (1774) и Ясского (1791) мирных договоров.\nСербии предоставлялась внутренняя автономия и право сербским чиновникам собирать налоги в пользу султана.\nВ Закавказье Турция признала расширение русских владений, но ей возвращалась крепость Анапа.",
        "reasons": []
    },
    {
        "beginDate": "1812-09-07T05:30",
        "endDate": "1812-09-07T17:00",
        "name": "Бородинское сражение",
        "discription": "Бородинское сражение, или Бородинская битва (во французской истории — битва у Москвы-реки, фр. Bataille de la Moskova), — крупнейшее сражение Отечественной войны 1812 года между русской армией под командованием генерала от инфантерии светлейшего князя Михаила Голенищева-Кутузова и французской армией под командованием императора Наполеона I Бонапарта. Состоялось 26 августа (7 сентября) 1812 года у села Бородино, в 125 км к западу от Москвы.",
        "reasons": []
    }
]